In [4]:
%matplotlib inline
import pandas as pd

In [5]:
from IPython.core.display import HTML
css = open('style-table.css').read() + open('style-notebook.css').read()
HTML('<style>{}</style>'.format(css))

In [6]:
titles = pd.read_csv('C:/Users/ksiaze/Desktop/pandas tutorial/titles.csv', index_col=None)
titles.head()

             title  year
0   Orlando Vargas  2005
1         Niu-Peng  1989
2    Anandabhadram  2005
3   Mahendra Varma  1993
4  Beomdiga shidae  1970

In [7]:
cast = pd.read_csv('C:/Users/ksiaze/Desktop/pandas tutorial/cast.csv', index_col=None)
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### Ile filmów (rekordów) zawiera DataFrame ``titles``?

In [7]:
len(titles)

214591

### Jakie są dwa najwcześniejsze filmy?

In [12]:
titles.sort_values('year').head(2)

                                                   title  year
90767                                         Miss Jerry  1894
10994  Reproduction of the Corbett and Fitzsimmons Fight  1897

### Ile filmów wyprodukowano pod tytułem "Hamlet"?

In [17]:
len(titles[titles.title=="Hamlet"])

19

### Ile jest filmów pod tytułem "North by Northwest"?

In [18]:
len(titles[titles.title=="North by Northwest"])

1

### Kiedy wyprodukowano pierwszy filmy "Hamlet"?

In [22]:
titles[titles.title == "Hamlet"].sort_values('year').head(2)

         title  year
100923  Hamlet  1910
179411  Hamlet  1911

### Wylistuj filmy "Treasure Island" od najwcześniejszego do najnowszego

In [23]:
titles[titles.title == 'Treasure Island'].sort_values('year')

                  title  year
48904   Treasure Island  1918
108475  Treasure Island  1920
89471   Treasure Island  1934
52435   Treasure Island  1950
118309  Treasure Island  1972
144139  Treasure Island  1973
191845  Treasure Island  1985
50325   Treasure Island  1999

### Ile filmów wyprodukowano w roku 1950?

In [28]:
len(titles[titles.year == 1950])

1036

### Ile filmów wyprodukowano w roku 1960?

In [29]:
len(titles[titles.year==1960])

1461

### Ile filmów wyprodukowano w latach 50 tych?

In [33]:
len(titles[(titles.year >= 1950) & (titles.year <= 1959)])

12110

### W jakich latach był produkowany film "Batman"?

In [56]:
t = titles
t = titles[titles.title=="Batman"]
t

        title  year
16656  Batman  1989
56309  Batman  1943

### Ile ról (cast) było obsadzonych w filmie "Inception"?

In [23]:
c = cast
c = cast[cast.title=="Titanic"]
c
#len(c.type)

         title  year             name     type                 character     n
4215   Titanic  1997  Lewis Abernathy    actor              Lewis Bodine  13.0
14663  Titanic  1997      Seth Adkins    actor  Slovakian 3 Year Old Boy  79.0
19575  Titanic  1953     Brian Aherne    actor       Captain E. J. Smith   6.0
19633  Titanic  1953   Patrick Aherne    actor                    Seaman   NaN
73949  Titanic  1997        Suzy Amis  actress             Lizzy Calvert  12.0

### Ile ról w filmie "Inception" NIE nie otrzymało rankingu (kolumna "n")?

In [22]:
c = cast
c = c[c.title == 'Titanic']
c = c[c.n.isnull()]
len(c)

1

0

### A ile ról w filmie "Inception" otrzymało ocenę rankingu w kolumnie "n"?

In [21]:
c = cast
c = c[c.title == 'Titanic']
c = c[c.n.notnull()]
len(c)

4

### Wyświetl obsadę filmu "North by Northwest" według liczby ocen od pierwszoplanowych, ignorując role, które nie otrzymały oceny

In [43]:
c = cast
c = c[c.title == 'Treasure Island']
c = c[c.n.notnull()]
c = c.sort_values(by='n', ascending=True)  # narastająco jest domyślnie
c

,title,year,name,type,character,n
16466,Treasure Island,1985,Yves Afonso,actor,French Captain,8.0
66568,Treasure Island,1972,Alibe,actress,Mrs. Silver,12.0
42602,Treasure Island,1972,Cristino Almod?var,actor,O'Brien,16.0
13434,Treasure Island,1950,Chris Adcock,actor,Pike,26.0

### Wyświetl całą obsadę według rankingu dla filmu "Sleuth" z 1972.

In [28]:
c = cast
c = c[c.title == "Sleuth"]
c = c[c.year == 1972]
c = c.sort_values(by='n')
c

Empty DataFrame
Columns: [title, year, name, type, character, n]
Index: []

### Wyświetl całą obsadę według liczby ocen filmu "Sleuth" z 2007 r.

### Ile ról było obsadzonych w niemej wersji Hamleta z 1921 r.?

In [32]:
c = cast
c = c[c.title == "Hamlet"]
c = c[c.year == 1921]
len(c)

1

In [31]:
c = cast
c = c[(c.title == 'Hamlet') & (c.year == 1921)]
len(c)

1

### Ile ról było obsadzonych w Hamlecie z 1996 r.?

In [33]:
c = cast
c = c[(c.title == "Hamlet") & (c.year == 1996)]
c

       title  year        name   type              character    n
1643  Hamlet  1996  Riz Abbasi  actor  Attendant to Claudius  1.0

### Ile ról filmu "Hamlet" było obsadzonych w calej historii kina?

In [35]:
c = cast
c = c[c.character == "Hamlet"]
len(c)

1

### Ilu aktorów grało rolę "Ophelia"?

In [36]:
c = cast
c = c[c.character == "Ophelia"]
c

            title  year                 name     type character   n
59232  Confession  1999  Paulina V. Ahlstrom  actress   Ophelia NaN

### Ilu aktorów grało rolę "The Dude"?

In [37]:
c = cast
c = c[c.character == "The Dude"]
c

Empty DataFrame
Columns: [title, year, name, type, character, n]
Index: []

### Ilu aktorów grało rolę "The Stranger"?

In [38]:
c = cast
c = c[c.character == "The Stranger"]
c

,title,year,name,type,character,n
25139,Theeb,2014,Hassan Mutlag Al-Maraiyeh,actor,The Stranger,3.0
34764,My Time to Die,2014,Vincent H. Alexander,actor,The Stranger,2.0

### Ile ról zagrał w swojej karierze Sidney Poitier?

In [39]:
c = cast
c = c[c.name == "Sidney Poitier"]
c

Empty DataFrame
Columns: [title, year, name, type, character, n]
Index: []

### Ile ról zagrała Judi Dench?

In [40]:
c = cast
c = c[c.name == "Judi Dench"]
len(c)

0

### Wylistuj role drugoplanowe (mające n=2) grane przez Cary Grant w latach 40, w porządku według roku.

In [51]:
c = cast
c = c[(c.name == 'Alibe') & (c.n == 12)]
c = c[c.year // 10 == 194]
c = c.sort_values('year')
c

Empty DataFrame
Columns: [title, year, name, type, character, n]
Index: []

### Wylistuj role pierwszoplanowe, które Cary Grant grał w latach 40 według roku.

In [52]:
c = cast
c = c[c.name == "Cary Grant"]
c = c[c.n == 1]
c = c[c.year // 10 == 194]
c

Empty DataFrame
Columns: [title, year, name, type, character, n]
Index: []

### Ile ról było dostępnych dla aktorów w latach 50tych?

In [56]:
c = cast
c = c[(c.year // 10 == 195) & (c.type == "actor")]
len(c)

2877

In [57]:
c = cast
c = c[c.year // 10 == 195]
c = c[c.type == 'actor']
len(c)

2877

### Ile ról było dostępnych dla aktorek w latach 50tych?

In [58]:
c = cast
c = c[(c.year // 10 == 195) & (c.type == "actress")]
len(c)

1015

### Ile ról pierwszoplanowych (n=1) było dostępnych od początku historii filmu do końca roku 1980?

In [60]:
c = cast
c = c[c.n == 1]
c = c[c.year <= 1980]
len(c)

1310

### Ile ról niepierwszoplanowych było dostępnych od początku historii kina do końca roku 1980?

In [61]:
c = cast
c = c[c.year <= 1980]
c = c[c.n != 1]
len(c)

20330

### Ile ról do końca 1980 było na tyle słabych, że nie otrzymało oceny "n"?

In [63]:
c = cast
c = c[c.year <= 1980]
c = c[c.n.isnull()]
len(c)

8126

## Koniec cz. 1